#include <stdio.h>

int birthday(int *month, int *day, int *days, char **m_name)
{
  printf("Enter your birthday [mm/dd] : ");
  scanf("%d/%d", month, day);
  
  if(1 <= *month && *month <= 12){    //’·î’¤¬1’·î’¤«’¤é12’·î’¤Î’´Ö’¤À’¤Ã’¤¿’¤é
    if(*(days+(*month-1)) >= *day && *day >= 1){   //’Æü’ÉÕ’¤¬1’°Ê’¾å’¤«’¤Ä’¤½’¤Î’·î’¤Î’Æü’¿ô’°Ê’²¼’¤À’¤Ã’¤¿’¤é
      printf("Your birthday is %s %d.\n", *(m_name + (*month-1)), *day);
      return 0;
    }
  }
  return -1;
}

int constellation(int month, int day, int *days, int term[][4], char **c_name)
{
  int i;
  
  if(1 <= month && month <= 12){    //’·î’¤¬1’·î’¤«’¤é12’·î’¤Î’´Ö’¤À’¤Ã’¤¿’¤é
    if(*(days+(month-1)) >= day && day > 0){    //’Æü’ÉÕ’¤¬1’°Ê’¾å’¤«’¤Ä’¤½’¤Î’·î’¤Î’Æü’¿ô’°Ê’²¼’¤À’¤Ã’¤¿’¤é
      for(i = 0; i < 12; i++){    //’·î’¤Ï12’·î’¤¢’¤ë’¤Î’¤Ç12’²ó’¥ë’¡¼’¥×
        if(term[i][0] == month){    //’·î’¤¬’À±’ºÂ’¤Î’³«’»Ï’·î’¤È’Æ±’¤¸’¤À’¤Ã’¤¿’¤é
          if(term[i][1] <= day && day <= days[month-1]){    //’À±’ºÂ’¤Î’³«’»Ï’Æü’°Ê’¾å’¤«’¤Ä’¤½’¤Î’·î’¤Î’Æü’¿ô’°Ê’²¼’¤À’¤Ã’¤¿’¤é
            printf("Therefore, your constellation is the %s.\n", *(c_name + i));    
            return 0;
          }
        }else if(term[i][2] == month){    //’·î’¤¬’À±’ºÂ’¤Î’½ª’Î»’·î’¤È’Æ±’¤¸’¤À’¤Ã’¤¿’¤é
          if(1 <= day && day <= term[i][3]){    //1’°Ê’¾å’¤«’¤Ä’À±’ºÂ’¤Î’½ª’Î»’Æü’°Ê’²¼’¤À’¤Ã’¤¿’¤é
            printf("Therefore, your constellation is the %s.\n", *(c_name + i));
            return 0;
          }
        }
      }
    }
  }
  return -1;
}
  
int main()
{
  char *c_name[12] = {"ARIES", "TAURUS", "GEMINI", "CANCER",
                      "LEO", "VIRGO", "LIBRA", "SCORPIO",
                      "SAGITTARIUS", "CAPRICORN", "AQUARIUS", "PISCES"};
  int term[12][4] = {{3, 21, 4, 19}, {4, 20, 5, 20}, {5, 21, 6, 21},
                     {6, 22, 7, 22}, {7, 23, 8, 22}, {8, 23, 9, 22},
                     {9, 23, 10, 23}, {10, 24, 11, 21}, {11, 22, 12, 21},
                     {12, 22, 1, 19}, {1, 20, 2, 18}, {2, 19, 3, 20}};
/* ’³Æ’·î’¤Î’Æü’¿ô ’¡Ê’¤¦’¤ë’¤¦’Ç¯’¤Î’È½’Äê’¤Ï’Ìµ’»ë’¤¹’¤ë) */
  int days[12] = {31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
/* ’³Æ’·î’¤Î’±Ñ’Ì¾ */
  char *m_name[12] = {"Jan.", "Feb.", "Mar.", "Apr.", "May.", "Jun.",
                      "Jul.", "Aug.", "Sep.", "Oct.", "Nov.", "Dec."};
  int month=0, day=0;

/* ’ÃÂ’À¸’Æü’¤ò’Æþ’ÎÏ’¤·’¤Æ’¡¢’³Î’Ç§’¤Î’Æü’ÉÕ’¤ò’½Ð’ÎÏ’¤¹’¤ë */
  if(birthday(&month,&day,days,m_name)){
    printf("Error : strange data was entered.\n");
    return -1;
  }
/* ’À±’ºÂ’¤ò’Ä´’¤Ù’¤Æ’½Ð’ÎÏ’¤¹’¤ë */
    if(constellation(month,day,days,term,c_name)){
    printf("Error : strange data was entered.\n");
    return -1;
  }
  return 0;
}

/*
’²Ý’Âê19’¡¢20
’É¸’½à’Æþ’ÎÏ’¤«’¤é’Æü’ÉÕ’¤ò’Æþ’ÎÏ’¤·’¡¢’±Ñ’¸ì’¤Î’·î’¤È’À±’ºÂ’¤ò’É½’¼¨’¤¹’¤ë’¥×’¥í’¥°’¥é’¥à
’¹Í’¤¨’Êý’¤È’¤·’¤Æ’¤Ï’·î’¤Î’Êý’¤Ï1’·î’¤«’¤é12’·î’¤«’¤Þ’¤Ç’¤ò’È½’Äê’¤·
’Æü’ÉÕ’¤¬1’°Ê’¾å’¤«’¤Ä’¡¢’¤½’¤Î’·î’¤Î’Æü’¿ô’°Ê’²¼’¤À’¤Ã’¤¿’¤é’É½’¼¨’¤¹’¤ë’¥×’¥í’¥°’¥é’¥à
’´Ø’¿ô’¤¬if’¤Î’Ãæ’¤Ë’¤¢’¤ë’¤Î’¤Ç’¡¢’°Û’¾ï’¤À’¤Ã’¤¿’¤é-1’¤ò’ÊÖ’¤¹’¤È’¥¨’¥é’¡¼’¡¢
’Àµ’¾ï’¤À’¤Ã’¤¿’¤é0’¤ò’ÊÖ’¤¹’¤³’¤È’¤Ç’Àµ’¾ï’½ª’Î»(if’Ê¸’¤Î’Ãæ’¤À’¤±)

’À±’ºÂ’¤Ï’ºÇ’½é’¤Ë’Æü’ÉÕ’¤¬’Àµ’¤·’¤¤’¤«’È½’Äê’¤ò’¤·’¡¢
’À±’ºÂ’¤Î’ÈÏ’°Ï’¤ò2’Ê¬’³ä
’¡¦’³«’»Ï’Æü’¤«’¤é’·î’Ëö
’¡¦’·î’Æ¬’¤«’¤é’½ª’Î»’Æü
’¤Ç’¹½’À®’¤¹’¤ë’¡£

12’·î’¤Ê’¤Î’¤Ç12’²ó’¥ë’¡¼’¥×’¤µ’¤»’¤Æ’¾å’µ­’¤Î2’Ê¬’³ä’¤·’¤¿’¾ò’·ï’¤ò’Ëþ’¤¿’¤·’¤¿’»þ
’À±’ºÂ’¤ò’É½’¼¨’¤·0’¤ò’ÊÖ’¤¹
’°Û’¾ï’»þ’¤Ï’Æ±’¤¸’¤¯-1’¤ò’ÊÖ’¤¹’¡£
*/
